In [1]:
# ANALISE DE DADOS
import pandas as pd

# GRAFICOS
import matplotlib.pyplot as plt

In [2]:
# CRIAR DATA SET FICTICIO
dados = {"Companhia": ["Azul", "Gol", "Latam", "Azul", "Gol"],
         "Preço_R$": [500,650,800,550, 700],
         "Duracao_min": [120,150, 200, 130, 100]}

df = pd.DataFrame(dados)

In [5]:
df

  Companhia  Preço_R$  Duracao_min
0      Azul       500          120
1       Gol       650          150
2     Latam       800          200
3      Azul       550          130
4       Gol       700          100